import { Injectable } from '@angular/core';
import { Post } from '../../model/post';

@Injectable({
  providedIn: 'root',
})

export class PostService {
  pathImg: string = "img/"
  getAllPosts():Post[]{
    return [
      {
        title: "เหตุผลเขา เหตุผลเรา",
        imgSrc: this.pathImg+"post0.jpg",
        message: `เหตุผลของเรา? เหตุผลของเขา?\nจริงของเขาหรือว่าจริงของเรา?\nจะจริงอันไหน เพราะอะไรหรือไม่ก็ตาม
เป็นเรื่องของสมมุติ\n\nการเห็นแจ้งแห่งความยึดมั่นในความคิด ความเชื่อ ว่าเป็นเรา เป็นตัวตนของเรา นำไปสู่หนทางแห่งวิมุตติ`,
      },
      {
        title: "ทุกสิ่งไม่เที่ยง เปลี่ยนแปลงอยู่เสมอ บังคับให้คงอยู่อย่างเดิมไม่ได้",
        imgSrc: this.pathImg+"post1.jpg",
        message: `สิ่งทั้งปวงไม่เที่ยง เป็นทุกข์ ไม่ใช่ตัวตน\nยึดสิ่งใดอยู่ ย่อมทุกข์เพราะสิ่งนั้น\nทางสายเอก คือมหาสติปัฏฐาน ๔`,
      },
      {
        title: "ธรรมะไม่ใช่ภาษา",
        imgSrc: this.pathImg+"post2.jpg",
        message: `ธรรมะไม่ใช่ภาษา นิพพานไม่ใช่ภาษา\nสิ่งใดที่เกิด สิ่งนั้นย่อมดับ\nพ้นออกจากอุปาทาน พ้นออกจากสิ่งที่เกิด และดับ\nพ้นออกจากว่าอะไรเป็นอะไร พ้นออกจากสัญญา ภาษา\nมีแต่เกิด และดับไปอยู่อย่างนั้น`,
      },
      {
        title: "เพราะมีเราจึงมีเขา",
        imgSrc: this.pathImg+"post3.jpg",
        message: `เราคิด แล้วเราก็เชื่อว่าเราคิด จึงมีเราถูก เราผิด เขาถูก เขาผิด\nความคิด ความเชื่อ เหตุผล ถูกผิดจะมีก็ได้ แต่จะต้องไม่มีเรา ไม่มีเขา จึงจะเป็นไปตามธรรม ใจจึงจะวางลงได้จริง`
      },
    ]
  }
}
