import { Injectable } from '@angular/core';
import { ReadingPost } from '../../model/post';

@Injectable({
  providedIn: 'root',
})
export class ReadingPostService {
  getAllPosts(): ReadingPost[] {
    return [
      {
        title: 'ความคิด',
        message: `เราคิดอย่างไร เราก็จะเชื่อไปตามความคิดของเรา เขาคิดอย่างไรเขาก็เชื่อความคิดของเขาอย่างนั้น ไม่ต่างจากเรา เราคิด เราเชื่อ ไปตามความลำเอียงของใจเรา แต่เราไม่เห็นว่าใจมันลำเอียง มันคิด มันเชื่อแล้วมันก็เกิดเป็นอารมณ์เกิดขึ้น ใจเราจมตกอยู่ในอารมณ์ เพราะความรู้ไม่ถึง ขาดสติ ปัญญา เราขาดความรู้ เพราะไม่เห็นว่าตนนั้นยึดถือเอาความคิด ความเชื่อนั้นเป็นตน ไม่มีหรอกความคิดใครดีกว่าใคร ความคิดก็เสมอกันที่ความคิด ความเชื่อก็เสมอกันที่ความเชื่อ แต่เพราะใจลำเอียงจึงมีความคิดเราดีกว่า ความคิดเขาดีกว่า เราจริงกว่า เขาไม่จริง เราถูก เขาผิด มีผู้แพ้ ผู้ชนะ แต่เราไม่เห็นว่าจริงๆ ไอตัวนี้แหละทำให้เราเป็นทุกข์ ไอถูก ไอผิด ไอเหตุผล ไอความคิด ความเชื่อ โดยมีการไปยึดมั่นหมายมั่นว่ามันมีค่า มีสูง มีต่ำ มีผิด มีถูก เพราะเราให้ค่าเองไม่ใช่หรอ ความคิดมันเป็นเพียงสิ่งที่เกิดขึ้นตามเหตุ และดับลงไปตามเหตุไม่ใช่หรือ ใช่หรอคือสิ่งที่เราควรไปยึดมั่นถือมั่น สิ่งที่เราควรทำคือถอนความยึดมั่นออกไม่ใช่หรอ เป็นแค่ผู้ชม ไม่ใช่ผู้แสดงจริง ถ้าแสดงจริงก็เหนื่อยจริง ถ้าเป็นแค่ผู้ชมก็ไม่เหนื่อย นั้นแหละเป็นทางที่พระพุทธเจ้าทรงชี้ ท่านทรงชี้ทางให้แก่ผู้ที่ยังไม่รู้ ให้ได้รู้ ท่านชี้ให้เรานั้นดำเนินจิตใจไปตามความจริง ไม่ใช่ดำเนินไปตามความลำเอียงความไม่รู้ เพราะใจเรานั้นยังไม่เป็นอันเดียวกับความจริง ใจมันจึงยังค้านกับความจริง มันจึงไม่สงบ ใจที่สงบไม่ใช่นิ่งเฉย ไม่รับรู้ แต่เพราะเป็นอันเดียวกับความจริง เพราะรู้ในความจริง ไม่ค้านต่อความจริงจึงสงบ`,
      },
    ];
  }
}
